tutorials/incompressibleVoF/forcedUpstreamWave/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    alpha.water 0;
}

zones
{
    cells
    {
        type        box;
        zoneType    cell;

        box         (-10000 -10000 -10000) (10000 0 10000);

        values
        {
            alpha.water 1;
        }
    }

    inletPatch
    {
        type        box;
        zoneType    face;

        box         (-10000 -10000 -10000) (10000 0 10000);

        values
        {
            alpha.water 1;
        }
    }
}

// ************************************************************************* //
